xufuq/stm32Helper/stm32_program/STM32C8T6_dataSend/USER/headfile.h

#ifndef _headfile_h
#define _headfile_h


//自带函数库
#include  "GPIOLIKE51.h"
#include  "misc.h"
#include  "stdint.h"
#include  "stm32f10x_conf.h"
#include  "system_stm32f10x.h"
#include  "stm32f10x_flash.h"
#include  "stm32f10x_gpio.h"
#include  "stm32f10x_rcc.h"
#include  "stm32f10x_adc.h"
#include  "stm32f10x_bkp.h"
#include  "stm32f10x_can.h"
#include  "stm32f10x_cec.h"
#include  "stm32f10x_crc.h"
#include  "stm32f10x_dac.h"
#include  "stm32f10x_dbgmcu.h"
#include  "stm32f10x_dma.h"
#include  "stm32f10x_exti.h"
#include  "stm32f10x_fsmc.h"
#include  "stm32f10x_i2c.h"
#include  "stm32f10x_iwdg.h"
#include  "stm32f10x_pwr.h"
#include  "stm32f10x_rtc.h"
#include  "stm32f10x_sdio.h"
#include  "stm32f10x_spi.h"
#include  "stm32f10x_tim.h"
#include  "stm32f10x_usart.h"
#include  "stm32f10x_wwdg.h"


//自写函数库
#include  "RC522.h"
#include  "OLED.h"
#include  "nrf24l01.h"
#include  "spi.h"


#endif
